In [4]:
import pandas as pd
import os
import numpy as np
import matplotlib.pyplot as plt

In [38]:
os.chdir(r'/home/devbox2/chetanya/dataSheets/')
os.getcwd()

'/home/devbox2/chetanya/dataSheets'

In [39]:
data=pd.read_csv('retail_another_new_clean.csv')

In [44]:
retail_another_new_clean_Cluster1=data[data['Cluster_index']==1]
retail_another_new_clean_Cluster1.to_csv('retail_another_new_clean_Cluster1.csv',index=False)

In [45]:
retail_another_new_clean_Cluster1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 319340 entries, 17 to 362887
Data columns (total 9 columns):
InvoiceNo           319340 non-null int64
StockCode           319340 non-null object
Description         319340 non-null object
Quantity            319340 non-null int64
UnitPrice           319340 non-null float64
CountInvoices       319340 non-null int64
logCountInvoices    319340 non-null float64
logUnitPrice        319340 non-null float64
Cluster_index       319340 non-null int64
dtypes: float64(3), int64(4), object(2)
memory usage: 24.4+ MB

In [32]:
data2=pd.read_csv('retail_new_clean_cluster1.csv')
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 319340 entries, 0 to 319339
Data columns (total 8 columns):
InvoiceNo           319340 non-null int64
StockCode           319340 non-null object
Description         319340 non-null object
UnitPrice           319340 non-null float64
CountInvoices       319340 non-null int64
logCountInvoices    319340 non-null float64
logUnitPrice        319340 non-null float64
Cluster_index       319340 non-null int64
dtypes: float64(3), int64(3), object(2)
memory usage: 19.5+ MB

In [56]:
test=retail_another_new_clean_Cluster1[['InvoiceNo','Description','Quantity', 'UnitPrice']].copy()

In [68]:
test=test.sort_values(by='InvoiceNo')

In [85]:
test['SellingPrice']=test['Quantity']* test['UnitPrice']

In [87]:
test.to_csv('retail_another_new_clean_Cluster1.csv',index=False)

In [89]:
test=pd.read_csv('retail_another_new_clean_Cluster1.csv')
test.head()

,InvoiceNo,Description,Quantity,UnitPrice,SellingPrice
0,536367,assortedcolourbirdornament,32,1.69,54.08
1,536367,feltcraftprincesscharlottedoll,8,3.75,30.00
2,536367,boxof6assortedcolourteaspoons,6,4.25,25.50
3,536367,homebuildingblockword,3,5.95,17.85
4,536367,lovebuildingblockword,3,5.95,17.85

In [97]:
demo=test.groupby('InvoiceNo')['Quantity','UnitPrice','SellingPrice'].sum()

In [98]:
demo.to_csv('salesNumbers.csv')

In [99]:
salesNumbers=pd.read_csv('salesNumbers.csv')

In [107]:
salesNumbers=salesNumbers.rename(columns={'Quantity':'SumQuantity','UnitPrice':'SumUnitPrice','SellingPrice':'SumSellingPrice'})

In [108]:
salesNumbers.head()

   InvoiceNo  TotalQuantity  TotalUnitPrice  TotalSellingPrice
0     536367             68           33.74             202.28
1     536368              9            9.20              40.35
2     536369              3            5.95              17.85
3     536370            407           49.39             731.96
4     536378            192           21.80             262.40

In [109]:
final=pd.merge(test,salesNumbers)

In [112]:
final.head(10)

,InvoiceNo,Description,Quantity,UnitPrice,SellingPrice,TotalQuantity,TotalUnitPrice,TotalSellingPrice
0,536367,assortedcolourbirdornament,32,1.69,54.08,68,33.74,202.28
1,536367,feltcraftprincesscharlottedoll,8,3.75,30.00,68,33.74,202.28
2,536367,boxof6assortedcolourteaspoons,6,4.25,25.50,68,33.74,202.28
3,536367,homebuildingblockword,3,5.95,17.85,68,33.74,202.28
4,536367,lovebuildingblockword,3,5.95,17.85,68,33.74,202.28
5,536367,doormatnewengland,4,7.95,31.80,68,33.74,202.28
6,536367,poppy'splayhousekitchen,6,2.10,12.60,68,33.74,202.28
7,536367,poppy'splayhousebedroom,6,2.10,12.60,68,33.74,202.28
8,536368,bluecoatrackparisfashion,3,4.95,14.85,9,9.20,40.35
9,536368,jammakingsetwithjars,6,4.25,25.50,9,9.20,40.35

In [126]:
rateMe=lambda x: (x/final['TotalSellingPrice'])*100

In [128]:
final['ratings']=(final['SellingPrice']/final['TotalSellingPrice'])*100

In [129]:
final.head()

,InvoiceNo,Description,Quantity,UnitPrice,SellingPrice,TotalQuantity,TotalUnitPrice,TotalSellingPrice,ratings
0,536367,assortedcolourbirdornament,32,1.69,54.08,68,33.74,202.28,26.735219
1,536367,feltcraftprincesscharlottedoll,8,3.75,30.00,68,33.74,202.28,14.830927
2,536367,boxof6assortedcolourteaspoons,6,4.25,25.50,68,33.74,202.28,12.606288
3,536367,homebuildingblockword,3,5.95,17.85,68,33.74,202.28,8.824402
4,536367,lovebuildingblockword,3,5.95,17.85,68,33.74,202.28,8.824402

In [130]:
test_model=final[['InvoiceNo','Description','ratings']]

In [132]:
test_model.to_csv('test_model.csv',index=False)

In [133]:
test_model.head()

   InvoiceNo                     Description    ratings
0     536367      assortedcolourbirdornament  26.735219
1     536367  feltcraftprincesscharlottedoll  14.830927
2     536367   boxof6assortedcolourteaspoons  12.606288
3     536367           homebuildingblockword   8.824402
4     536367           lovebuildingblockword   8.824402